xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_PWM.cpp
#ifdef ESP32_PLATFORM

#include "VM.h"
#include "GC.h"
#include <Arduino.h>

#include "ESP32Driver/Esp32Driver.h"

#if ESP32_PWM_ENALBED

uint8_t pwmChannelObjectsBuffer[sizeof(VMObject) * MAX_PWM_CHANNELS];

VMObject* pwmChannelObjects = (VMObject*)pwmChannelObjectsBuffer;

void InitPWMChannels(){
    for(int i = 0;i < MAX_PWM_CHANNELS;i++){
        new (&pwmChannelObjects[i]) VMObject(ValueType::OBJECT);
        pwmChannelObjects[i].implement.objectImpl[L"channel"] = CreateNumberVariable(i);
        pwmChannelObjects[i].implement.objectImpl[L"frequency"] = CreateNumberVariable(1000);
        pwmChannelObjects[i].implement.objectImpl[L"resolution"] = CreateNumberVariable(10);
        //PWMObject.attach(pin);
        pwmChannelObjects[i].implement.objectImpl[L"attach"] = VM::CreateSystemFunc(1,[](std::vector<VariableValue>& args, VMObject* thisValue,VMWorker* currentWorker) -> VariableValue{
            if(args[0].getContentType() != ValueType::NUM){
                currentWorker->ThrowError(L"PWM.attach only accept number");
                return VariableValue();
            }
            uint32_t freq = thisValue->implement.objectImpl[L"frequency"].content.number;
            uint32_t res = thisValue->implement.objectImpl[L"resolution"].content.number;
            uint32_t channel = thisValue->implement.objectImpl[L"channel"].content.number;
            uint8_t pin = args[0].content.number;
            ledcSetup(channel,freq,res);
            ledcAttachPin(pin,channel);
            return VariableValue();
        });
        //PWMObject.setDuty(duty);
        pwmChannelObjects[i].implement.objectImpl[L"setDuty"] = VM::CreateSystemFunc(1,[](std::vector<VariableValue>& args, VMObject* thisValue,VMWorker* currentWorker) -> VariableValue{
            if(args[0].getContentType() != ValueType::NUM){
                currentWorker->ThrowError(L"setDuty only accept number");
                return VariableValue();
            }
            uint32_t channel = thisValue->implement.objectImpl[L"channel"].content.number;
            ledcWrite(channel,(uint32_t)args[0].content.number);
            return VariableValue();
        });
    }
}

#endif

#endif